title: notepad++
id: 2617e7ed-adb7-40ba-b0f3-8f9945fe6c09
status: test
description: Detects notepad++ launch
references:
    - https://sigconverter.io/
author: ra4ina
date: 2026-01-22
modified: 2026-01-22
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - notepad++.exe
            - notepada++.exe
    condition: all of selection*
falsepositives:
    - directory is named notepad++
level: low